In [ ]:
'''
DataFrame은 2차원 배열형식, 표같은 스프레드시트 구조
여러개의 컬럼을 가지며 서로다른 종류의 값이 담긴다.
서로 다른 시리즈의 결합(서로 다른 종류의 값이 담겨있다.)

DataFrame은 다양한 방법으로 생성할 수 있다.
가장 흔하게 사용할 수 있는 방법으로는
1) 리스트 값을 딕셔너리로 사용
2) Numpy 배열을 이용해서
3) read_csv(), read_excel(), read_html() 함수등을 이용해서!!
'''

### DataFrame

#### 1. DataFrame 생성 - 딕셔너리 이용

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
import matplotlib as plt

In [12]:
list_dic={'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
          'year':[2000, 2001, 2002, 2001, 2002, 2003],
          'pop' : [1.5, 1.7, 1.6, 2.4, 2.9, 3.2]
}

# DataFrame?
'''
state, year, pop 각각의 컬럼에 해댕하는 상->하 방향의 한줄한줄이 시리즈라고 보면 된다.
DataFrame은 시리즈들의 결합체
시리즈는 ndarray타입(넙파이 배열, 같은 데이터 타입만 사용 가능)으로 만들어져 있다.
'''
dicOf = DataFrame(list_dic)
dicOf

print(type(dicOf.state))
print(type(dicOf.year))
# print(type(dicOf.pop))
print(type(dicOf['pop']))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [13]:
data1 = {
    'name':['James', 'Peter', 'Robert', 'Tom'],
    'address':['NY', 'NY', 'LA', 'Texas'],
    'age':[33,44,55,66]
}

df1 = DataFrame(data1)
df1

     name address  age
0   James      NY   33
1   Peter      NY   44
2  Robert      LA   55
3     Tom   Texas   66

#### 2. DataFrame 생성 - Numpy 배열 사용

In [18]:
df2=DataFrame(np.random.randint(10,100,16).reshape(4,4),
             index=list('ABCD'),
             columns=list('ABCD'))
df2.columns = ['one', 'two', 'three', 'four']
df2

   one  two  three  four
A   89   27     65    87
B   13   91     16    15
C   57   17     47    75
D   83   13     88    85

#### 3. DataFrame 생성 - read_csv() 함수 사용

In [20]:
'''
1. CSV(Comma Seperated Value)
2. 각각의 값들이 (컬럼에 해당하는 값) 어떤 데이터를 의미하는지 알고
'''
df3 = pd.read_csv('../data/tips.csv')
df3

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner   2.0
1         10.34  1.66    Male     No   Sun  Dinner   3.0
2         21.01  3.50    Male     No   Sun  Dinner   3.0
3         23.68  3.31    Male     No   Sun  Dinner   2.0
4         24.59  3.61  Female     No   Sun  Dinner   4.0
..          ...   ...     ...    ...   ...     ...   ...
240       27.18  2.00  Female    Yes   Sat  Dinner   2.0
241       22.67  2.00    Male    Yes   Sat  Dinner   2.0
242       17.82  1.75    Male     No   Sat  Dinner   2.0
243       18.78  3.00  Female     No  Thur  Dinner   2.0
244       25.34   NaN     NaN    NaN   NaN     NaN   NaN

[245 rows x 7 columns]

#### 4.DataFrame - 구조

In [22]:
df1

     name address  age
0   James      NY   33
1   Peter      NY   44
2  Robert      LA   55
3     Tom   Texas   66

In [30]:
print(df1.index)
print(df1.columns)
print(df1.values)
print(df1.dtypes) #뒤에 s를 붙어야 한다
print('*'*30)
print(df1.T) #Transpose:행과 열을 뒤바꿈
df1.info()

RangeIndex(start=0, stop=4, step=1)
Index(['name', 'address', 'age'], dtype='object')
[['James' 'NY' 33]
 ['Peter' 'NY' 44]
 ['Robert' 'LA' 55]
 ['Tom' 'Texas' 66]]
name       object
address    object
age         int64
dtype: object
******************************
             0      1       2      3
name     James  Peter  Robert    Tom
address     NY     NY      LA  Texas
age         33     44      55     66
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     4 non-null      object
 1   address  4 non-null      object
 2   age      4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

#### 5. DataFrame - 가장 많이 사용되는 조회함수

In [38]:
df3
df3.head() #default:5개 조회
df3.head(2)
df3.tail()
df3.tail(2)
df3.info()
print(df3.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 245 entries, 0 to 244
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  245 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    float64
dtypes: float64(3), object(4)
memory usage: 13.5+ KB
(245, 7)